RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_scb_i2c.c
/*******************************************************************************
* Function Name: Cy_SCB_I2C_SetDataRate
****************************************************************************//**
*
* Configures the SCB to work at the desired data rate.
*
* \param base
* The pointer to the I2C SCB instance.
*
* \param dataRateHz
* The desired data Rate in Hz.
*
* \param scbClockHz
* The frequency of the clock connected to the SCB in Hz.
*
* \return
* The achieved data rate in Hz. \n
* When zero value is returned there is an error in the input parameters:
* data rate or clk_scb is out of valid range.
*
* \note
* This function does not change the values of the clock divider connected
* to the SCB, it changes only the SCB clock oversample registers. If this
* function is not able to achieve the desired data rate, then the clock
* divider must be adjusted. Call this function only while the SCB is
* disabled. For the slave, this function only checks that the attached clock is
* fast enough to meet the desired data rate. It does not change any registers.
*
*******************************************************************************/
uint32_t Cy_SCB_I2C_SetDataRate(CySCB_Type *base, uint32_t dataRateHz, uint32_t scbClockHz)
{
    CY_ASSERT_L2(scbClockHz > 0UL);
    CY_ASSERT_L2(CY_SCB_I2C_IS_DATA_RATE_VALID(dataRateHz));

    uint32_t actualDataRateHz = 0UL;

    if (((uint32_t) CY_SCB_I2C_SLAVE) == _FLD2VAL(CY_SCB_I2C_CTRL_MODE, SCB_I2C_CTRL(base)))
    {
        actualDataRateHz = Cy_SCB_I2C_GetDataRate(base, scbClockHz);

        /* Use an analog filter for the slave */
        SCB_RX_CTRL(base) &= (uint32_t) ~SCB_RX_CTRL_MEDIAN_Msk;
        SCB_I2C_CFG(base)  = CY_SCB_I2C_ENABLE_ANALOG_FITLER;
    }
    else
    {
        bool errorRange = true;
        uint32_t sclLow;
        uint32_t sclHigh;

        uint32_t lowPhase  = 8U;
        uint32_t highPhase = 8U;
        bool enableMedian  = false;

        /* Get duration of SCL low and high for the selected data rate */
        if ((0U == dataRateHz) || (dataRateHz > CY_SCB_I2C_FSTP_DATA_RATE))
        {
            errorRange = true;
        }
        else if (dataRateHz <= CY_SCB_I2C_STD_DATA_RATE)
        {
            /* Check SCB clock ranges for Standard rate */
            if ((scbClockHz >= CY_SCB_I2C_MASTER_STD_CLK_MIN) && (scbClockHz <= CY_SCB_I2C_MASTER_STD_CLK_MAX))
            {
                sclLow  = CY_SCB_I2C_MASTER_STD_SCL_LOW;
                sclHigh = CY_SCB_I2C_MASTER_STD_SCL_HIGH;
                enableMedian = false;

                errorRange = false;
            }
        }
        else if (dataRateHz <= CY_SCB_I2C_FST_DATA_RATE)
        {
            /* Check SCB clock ranges for Fast rate */
            if ((scbClockHz >= CY_SCB_I2C_MASTER_FST_CLK_MIN) && (scbClockHz <= CY_SCB_I2C_MASTER_FST_CLK_MAX))
            {
                sclLow  = CY_SCB_I2C_MASTER_FST_SCL_LOW;
                sclHigh = CY_SCB_I2C_MASTER_FST_SCL_HIGH;
                enableMedian = false;

                errorRange = false;
            }
        }
        else
        {
            /* Check SCB clock ranges for Fast rate */
            if ((scbClockHz >= CY_SCB_I2C_MASTER_FSTP_CLK_MIN) && (scbClockHz <= CY_SCB_I2C_MASTER_FSTP_CLK_MAX))
            {
                /* Check SCB clock ranges for Fast rate */
                sclLow  = CY_SCB_I2C_MASTER_FSTP_SCL_LOW;
                sclHigh = CY_SCB_I2C_MASTER_FSTP_SCL_HIGH;
                enableMedian = true;

                errorRange = false;
            }
        }

        /* Calculate data rate if data rate and clock ranges are valid */
        if (!errorRange)
        {
            bool updateLowPhase;

            /* Get period of the SCB clock in ns */
            uint32_t period = 1000000000U / scbClockHz;

            /* Get low phase minimum value in SCB clocks */
            lowPhase = sclLow / period;

            if ((period * lowPhase) < sclLow)
            {
                ++lowPhase;
            }

            if (lowPhase > CY_SCB_I2C_LOW_PHASE_MAX)
            {
                lowPhase = CY_SCB_I2C_LOW_PHASE_MAX;
            }

            /* Define if update low phase */
            updateLowPhase = (lowPhase < CY_SCB_I2C_LOW_PHASE_MAX);

            /* Get high phase minimum value in SCB clocks */
            highPhase = sclHigh / period;

            if ((period * highPhase) < sclHigh)
            {
                ++highPhase;
            }

            if (highPhase > CY_SCB_I2C_HIGH_PHASE_MAX)
            {
                highPhase = CY_SCB_I2C_HIGH_PHASE_MAX;
            }

            /* Get actual data rate */
            actualDataRateHz = scbClockHz / (lowPhase + highPhase);

            /* Find desired data rate */
            while ((actualDataRateHz > dataRateHz) && ((lowPhase + highPhase) < CY_SCB_I2C_DUTY_CYCLE_MAX))
            {
                /* Increase low and high phase to reach desired data rate */
                if (updateLowPhase)
                {
                    if (lowPhase < CY_SCB_I2C_LOW_PHASE_MAX)
                    {
                        /* Update low phase */
                        lowPhase++;
                        updateLowPhase = false;
                    }
                }
                else
                {
                    if (highPhase < CY_SCB_I2C_HIGH_PHASE_MAX)
                    {
                        /* Update high phase */
                        highPhase++;
                        updateLowPhase = (lowPhase < CY_SCB_I2C_LOW_PHASE_MAX);
                    }
                }

                /* Update actual data rate */
                actualDataRateHz = scbClockHz / (lowPhase + highPhase);
            }

            /* Set filter configuration based on actual data rate */
            if (enableMedian)
            {
                /* Use a digital filter */
                SCB_RX_CTRL(base) |= (uint32_t) SCB_RX_CTRL_MEDIAN_Msk;
                SCB_I2C_CFG(base)  = CY_SCB_I2C_DISABLE_ANALOG_FITLER;
            }
            else
            {
                /* Use an analog filter */
                SCB_RX_CTRL(base) &= (uint32_t) ~SCB_RX_CTRL_MEDIAN_Msk;
                SCB_I2C_CFG(base)  = CY_SCB_I2C_ENABLE_ANALOG_FITLER;
            }

